{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Hello",
        "Good morning",
        "Good afternoon",
        "Good evening"
      ],
      "responses": [
        "Hello! Welcome to TravelBot. How can I help with your travel plans?",
        "Hi there! Ready to plan your next adventure?",
        "Greetings! Where would you like to travel today?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye", "Thanks for your help"],
      "responses": [
        "Safe travels! Come back if you need more travel tips.",
        "Bon voyage! Have a wonderful trip!",
        "Goodbye! Don't forget your passport!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Appreciate it"],
      "responses": [
        "Happy to help with your travel plans!",
        "You're welcome! Safe journeys!",
        "My pleasure! Where to next?"
      ]
    },
    {
      "tag": "destinations",
      "patterns": [
        "What destinations do you recommend?",
        "Where should I travel?",
        "Best places to visit",
        "Top travel spots"
      ],
      "responses": [
        "Popular destinations include Bali, Paris, Tokyo, and New York. What type of vacation are you looking for?",
        "I can recommend beach destinations, mountain getaways, or city adventures. What interests you?",
        "For culture: Rome or Kyoto. For beaches: Maldives or Hawaii. For adventure: New Zealand or Costa Rica."
      ]
    },
    {
      "tag": "packing",
      "patterns": [
        "What should I pack?",
        "Packing list for travel",
        "Essential items to bring",
        "What to pack for my trip"
      ],
      "responses": [
        "Always pack: passport, medications, chargers, and comfortable shoes. The rest depends on your destination!",
        "For tropical climates: swimwear, sunscreen, insect repellent. For cold weather: layers, gloves, warm hat.",
        "I recommend packing light with versatile clothing. Don't forget travel adapters and any necessary visas!"
      ]
    },
    {
      "tag": "visa",
      "patterns": [
        "Do I need a visa?",
        "Visa requirements",
        "Travel documents needed",
        "Passport requirements"
      ],
      "responses": [
        "Visa requirements vary by country and your nationality. Where are you planning to go?",
        "Most countries require your passport to be valid for 6 months beyond your travel dates. Specific visa requirements depend on the destination.",
        "I can check visa requirements if you tell me your destination and nationality."
      ]
    },
    {
      "tag": "budget",
      "patterns": [
        "Budget travel tips",
        "How to travel cheaply",
        "Affordable destinations",
        "Save money while traveling"
      ],
      "responses": [
        "Consider off-season travel, budget airlines, hostels, and local street food to save money!",
        "Southeast Asia, Eastern Europe, and Central America offer great value for budget travelers.",
        "Travel hacking with credit card points and booking in advance can help reduce costs significantly."
      ]
    },
    {
      "tag": "safety",
      "patterns": [
        "Is it safe to travel to...",
        "Travel safety tips",
        "How to stay safe abroad",
        "Dangerous places to avoid"
      ],
      "responses": [
        "Check government travel advisories, get travel insurance, and research local customs for safety.",
        "Most tourist destinations are safe with basic precautions. Avoid displaying valuables and learn emergency numbers.",
        "Register with your embassy, share your itinerary, and keep digital copies of important documents for safety."
      ]
    }
  ]
}